# Exercise 4.9 Data Prep
## This notebook has the following steps
## 1. Import Libraries
## 2. previewing Dataframe
## 3. Data Wrangling
## 4. Data quality and consistancy checks
## 5. Dataframe merge
## 6. Export merged DF as .pkl

In [2]:
# Import libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [3]:
# create directory path 
path = r'C:\Users\luke_\Desktop\CF Datacourse\Python_exercise4\09-2024 Instacart Basket Analysis\02_data'

In [4]:
# Import new customer data set from the 'Original Data' folder as a dataframe
customers = pd.read_csv(os.path.join(path, 'original_data', 'customers.csv'))

In [5]:
# Preview the newly imported dataframe 
customers.head(10)

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
5,133128,Cynthia,Noble,Female,Kentucky,43,1/1/2017,2,married,49643
6,152052,Chris,Walton,Male,Montana,20,1/1/2017,0,single,61746
7,168851,Joseph,Hickman,Male,South Carolina,30,1/1/2017,0,single,63712
8,69965,Jeremy,Vang,Male,Texas,47,1/1/2017,1,married,162432
9,82820,Shawn,Chung,Male,Virginia,26,1/1/2017,2,married,32072

In [6]:
# Check the dimensions of the dataframe
customers.shape

(206209, 10)

In [7]:
# View descriptive statistics 
customers.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [8]:
# Check data types
customers.dtypes

user_id          int64
First Name      object
Surnam          object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

## 4.Wrangle the data so that it follows consistent logic

In [9]:
# Rename the columns to establish uniformity
customers.rename(columns = {'First Name' : 'first_name'}, inplace = True)

In [10]:
customers.rename(columns = {'Surnam' : 'last_name'}, inplace = True)

In [11]:
customers.rename(columns = {'Gender' : 'gender'}, inplace = True)

In [12]:
customers.rename(columns = {'Age' : 'age'}, inplace = True)

In [13]:
customers.rename(columns = {'STATE' : 'state'}, inplace = True)

In [14]:
# Check columns
customers.columns

Index(['user_id', 'first_name', 'last_name', 'gender', 'state', 'age',
       'date_joined', 'n_dependants', 'fam_status', 'income'],
      dtype='object')

In [15]:
# columns have been renamed where appropriate

In [16]:
customers.head(5)

,user_id,first_name,last_name,gender,state,age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [17]:
# All columns can be analysed, so I will not be droppinng any.

## 5.Complete the fundamental data quality and consistency checks you’ve learned throughout this Achievement

In [18]:
# Address data-types and potential mixed data-types in the dataframe
customers.dtypes

user_id          int64
first_name      object
last_name       object
gender          object
state           object
age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

In [19]:
# Checking for mixed data-types in each column
for col in customers.columns.tolist():
  weird = (customers[[col]].map(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customers[weird]) > 0:
    print (col)

first_name

In [20]:
# Column 'first_name has mixed data types. I will change it all to a string data type
customers['first_name'] = customers['first_name'].astype('str')

In [21]:
#'user_id' column is listed as an integer, I will change it to a string
customers['user_id'] = customers['user_id'].astype('str')

In [22]:
# checking data-types again to confirm changes
customers.dtypes

user_id         object
first_name      object
last_name       object
gender          object
state           object
age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

In [23]:
for col in customers.columns.tolist():
  weird = (customers[[col]].map(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customers[weird]) > 0:
    print (col)

## There were no returns from the for-loop function. There are no mixed data types in the dataframe.

In [24]:
# Check for missing data
customers.isnull().sum()

user_id         0
first_name      0
last_name       0
gender          0
state           0
age             0
date_joined     0
n_dependants    0
fam_status      0
income          0
dtype: int64

In [25]:
# Checking for duplicates
customers_dups = customers[customers.duplicated()]

In [26]:
customers_dups

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, n_dependants, fam_status, income]
Index: []

## There were no duplicated returned.

In [27]:
# Check descriptive stats to see if there are any obvious inconsistancies
customers.describe()

                 age   n_dependants         income
count  206209.000000  206209.000000  206209.000000
mean       49.501646       1.499823   94632.852548
std        18.480962       1.118433   42473.786988
min        18.000000       0.000000   25903.000000
25%        33.000000       0.000000   59874.000000
50%        49.000000       1.000000   93547.000000
75%        66.000000       3.000000  124244.000000
max        81.000000       3.000000  593901.000000

## Everything looks normal in the descriptive stats.

# 6.Combine your customer data with the rest of your prepared Instacart data.

In [28]:
# Import the rest of the prepared Instacart data
ords_prods_merged = pd.read_pickle(os.path.join(path, 'prepared_data', 'ords_prods_merged_4.8.2.pkl'))

In [29]:
# Check the shape of the newly imported dataframe
ords_prods_merged.shape

(32404859, 24)

In [30]:
# Check the shape of the customers dataframe
customers.shape

(206209, 10)

In [31]:
# Identify a shared column
ords_prods_merged.head(5)

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,order_day_of_week,time_of_order,...,price_range_loc,Busiest_day,days_performance,busiest_period_of_day,max_order,loyalty_flag,user_order_behaviour,frequency_flag,user_spending_behaviour,spending_flag
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,28,6,11,...,Mid-range product,Regularly busy,Regular Days,Most orders,32,Regular customer,30.0,Non-frequent customer,6.935811,High Spender
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,30,6,17,...,Mid-range product,Regularly busy,Regular Days,Average orders,32,Regular customer,30.0,Non-frequent customer,6.935811,High Spender
2,1,Chocolate Sandwich Cookies,61,19,5.8,389851,709,2,0,21,...,Mid-range product,Busiest day,Busiest Days,Average orders,5,New customer,8.0,Frequent customer,7.930208,High Spender
3,1,Chocolate Sandwich Cookies,61,19,5.8,652770,764,1,3,13,...,Mid-range product,Regularly busy,Slowest Days,Most orders,3,New customer,13.0,Regular customer,4.972414,High Spender
4,1,Chocolate Sandwich Cookies,61,19,5.8,1813452,764,3,4,17,...,Mid-range product,Least busy,Slowest Days,Average orders,3,New customer,13.0,Regular customer,4.972414,High Spender

In [32]:
customers.head(5)

,user_id,first_name,last_name,gender,state,age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [33]:
# The dataframes share the 'user_id' column
# Checking data-type of 'user_id' column
ords_prods_merged.dtypes['user_id']

dtype('int64')

In [34]:
customers.dtypes['user_id']

dtype('O')

In [35]:
# Ensure both key columns are the same data type
ords_prods_merged['user_id'] = ords_prods_merged['user_id'].astype('str')

In [36]:
ords_prods_merged.dtypes['user_id']

dtype('O')

In [37]:
# Drop the '_merge' column to prepare for new merge
ords_prods_merged = ords_prods_merged.drop(columns=['_merge'])

## Merge the two dataframes using the column 'user_id'

In [38]:
instacart_data_merge = ords_prods_merged.merge(customers, on = 'user_id', indicator = True)

In [39]:
# Check shape of newly merged dataframe
instacart_data_merge.shape

(32404859, 33)

In [40]:
instacart_data_merge.head()

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,order_day_of_week,time_of_order,...,first_name,last_name,gender,state,age,date_joined,n_dependants,fam_status,income,_merge
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,28,6,11,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,30,6,17,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both
2,1,Chocolate Sandwich Cookies,61,19,5.8,389851,709,2,0,21,...,Deborah,Glass,Female,Vermont,66,6/16/2018,2,married,158302,both
3,1,Chocolate Sandwich Cookies,61,19,5.8,652770,764,1,3,13,...,Heather,Myers,Female,Wisconsin,40,2/9/2020,3,married,31308,both
4,1,Chocolate Sandwich Cookies,61,19,5.8,1813452,764,3,4,17,...,Heather,Myers,Female,Wisconsin,40,2/9/2020,3,married,31308,both

In [41]:
# Check '_merge' column frequency
instacart_data_merge['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

In [42]:
# Check data-type consistancy
instacart_data_merge.dtypes

product_id                    int64
product_name                 object
aisle_id                      int64
department_id                 int64
prices                      float64
order_id                      int64
user_id                      object
order_number                  int64
order_day_of_week             int64
time_of_order                 int64
days_since_prior_order      float64
add_to_cart_order             int64
reordered                     int64
price_range_loc              object
Busiest_day                  object
days_performance             object
busiest_period_of_day        object
max_order                     int64
loyalty_flag                 object
user_order_behaviour        float64
frequency_flag               object
user_spending_behaviour     float64
spending_flag                object
first_name                   object
last_name                    object
gender                       object
state                        object
age                           int64
date_joined                  object
n_dependants                  int64
fam_status                   object
income                        int64
_merge                     category
dtype: object

In [43]:
instacart_data_merge.dtypes

product_id                    int64
product_name                 object
aisle_id                      int64
department_id                 int64
prices                      float64
order_id                      int64
user_id                      object
order_number                  int64
order_day_of_week             int64
time_of_order                 int64
days_since_prior_order      float64
add_to_cart_order             int64
reordered                     int64
price_range_loc              object
Busiest_day                  object
days_performance             object
busiest_period_of_day        object
max_order                     int64
loyalty_flag                 object
user_order_behaviour        float64
frequency_flag               object
user_spending_behaviour     float64
spending_flag                object
first_name                   object
last_name                    object
gender                       object
state                        object
age                           int64
date_joined                  object
n_dependants                  int64
fam_status                   object
income                        int64
_merge                     category
dtype: object

# 8. Export this new dataframe as a pickle file

In [44]:
instacart_data_merge.to_pickle(os.path.join(path,'prepared_data', 'ords_prods_custos_merged.pkl'))